      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Ejercicio11.

       DATA DIVISION.

       FILE SECTION.

       WORKING-STORAGE SECTION.
           77 WS-FECHA          PIC X(10)      VALUE '2006-04-08'.
           01 WS-AÑO            PIC 9(4).
           01 WS-MES            PIC 9(2).
           01 WS-DIA            PIC 9(2).

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.

            STOP RUN.

       END PROGRAM Ejercicio11.
